export class Stage{
    constructor(stageLevel, stageWidth, stageHeight){
        this.stageLevel = stageLevel;
        this.wallsXCount = 24;
        this.wallsYCount = 6;
        this.wallsWidth_horizontal = stageWidth/24;
        this.wallsHeight_horizontal = stageHeight/11; 
    //배열화를 통해 스테이지를 만들 때 일률적으로 만들 수 있다
        //벽돌에 대한 정의
        this.walls =[
            [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
            [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
            [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
            [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
            [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
            [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
        ];
        this.walls_hor_X=[
            [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
        ];
        this.walls_hor_Y=[
            [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
        ];
      //반복문을 이용해 만들어진 배열에 값을 다 넣는다, 모든 디바이스에 적용하기 위해
      //비율에 따른 x, y 좌표 설정을 했으며 반복문을 돌릴 때 한번씩 계산값을 더 써줬다
        //for 반복문으로 실제값 생성, let을 사용
         this.y = stageHeight/20;
        for(let i = 0; i < this.walls.length; i++){
            this.x=0; this.y += this.wallsHeight_horizontal;
            for(let j = 0; j < this.walls[i].length; j++){
                this.walls_hor_X[i][j]=this.x;
                this.walls_hor_Y[i][j]=this.y;
                
                //좌표 증감
                this.x += this.wallsWidth_horizontal;              
            }
        }
    }

}
